Catalogs/стомВидыЗубныхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>стомВидыЗубныхКарт</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ШиринаКанвы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысотаКанвы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TranslateX</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TranslateY</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Rotation</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ScaleX</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ScaleY</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокЗубов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Зуб</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.стомВидыЗубов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TranslateX</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TranslateY</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Rotation</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ScaleX</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ScaleY</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ZIndex</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновнойВариант</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.стомВариантыЗубов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтроковоеПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обозначение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗубВКарте</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.стомЗубыКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокВариантов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВариантКарты</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.стомВариантыЗубныхКарт</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтроковоеПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокВариантовЗубов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВариантЗуба</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.стомВариантыЗубов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокОбщихСегментов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВариантЗуба</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.стомВариантыЗубов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СегментВКарте</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.стомСегментыЗубов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкаВариантовОбластей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВариантКарты</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.стомВариантыЗубныхКарт</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗубВКарте</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.стомЗубыКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантЗуба</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.стомВариантыЗубов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Область</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.стомОбластиСегментов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/стомЗубыКарты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>стомЗубыКарты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.стомВидыЗубныхКарт</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Зуб</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомВидыЗубов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TranslateX</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TranslateY</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Rotation</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ScaleX</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ScaleY</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ZIndex</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/стомВариантыЗубов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>стомВариантыЗубов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обозначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конструкция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокОбластей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Область</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.стомОбластиСегментов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/стомВариантыЗубныхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>стомВариантыЗубныхКарт</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>СписокВариантовЗубов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВариантЗуба</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.стомВариантыЗубов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/стомСегментыЗубов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>стомСегментыЗубов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.стомВидыЗубов</xr:Item>
				<xr:Item>Catalog.стомВидыЗубныхКарт</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сегмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомВидыСегментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TranslateX</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TranslateY</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ScaleX</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ScaleY</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Rotation</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ZIndex</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/стомВидыЗубныхКарт/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Перем ТекВариантКарты;

&НаКлиенте
Перем ТекЗубКарты;

&НаКлиенте
Перем ТекСегментЗуба;

//----------------------ИНИЦИАЛИЗАЦИЯ------------------------

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Объект.Ссылка.Пустая() Тогда
		Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			ЗаполнитьСписокВариантовИЗубов(Параметры.ЗначениеКопирования);
			ЗаполнитьСписокСегментов(Параметры.ЗначениеКопирования);
		Иначе
			ИнициализацияНового();
		КонецЕсли;
		//если элемент создан копированием, то нужно "придумать" новые ID для сегментов
		//Для Каждого СтрокаЗуб Из Объект.СписокЗубов Цикл
		//	СтрокаЗуб.ИдентификаторСтроки = Новый УникальныйИдентификатор();
		//КонецЦикла;
	Иначе
		ЗаполнитьСписокВариантовИЗубов();
		ЗаполнитьСписокСегментов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
	
КонецПроцедуры

Процедура ЗаполнитьСписокЗубов(ЗначениеКопирования = Неопределено)
	
	Если ЗначениеКопирования = Неопределено Тогда
		ТекОбъект = Объект.Ссылка;
	Иначе
		ТекОбъект = ЗначениеКопирования;
	КонецЕсли;
	
	СписокЗубов.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	стомЗубыКарты.Ссылка КАК ЗубВКарте,
	|	стомЗубыКарты.TranslateX,
	|	стомЗубыКарты.TranslateY,
	|	стомЗубыКарты.Rotation,
	|	стомЗубыКарты.ScaleX,
	|	стомЗубыКарты.ScaleY,
	|	стомЗубыКарты.ZIndex КАК ZIndex,
	|	стомЗубыКарты.Наименование,
	|	стомЗубыКарты.Зуб,
	|	стомЗубыКарты.ОсновнойВариант
	|ИЗ
	|	Справочник.стомЗубыКарты КАК стомЗубыКарты
	|ГДЕ
	|	стомЗубыКарты.Владелец = &ТекОбъект
	|
	|УПОРЯДОЧИТЬ ПО
	|	ZIndex";
	Запрос.УстановитьПараметр("ТекОбъект", ТекОбъект);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = СписокЗубов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.ИдентификаторSL = Строка(Выборка.ЗубВКарте.УникальныйИдентификатор());
		НоваяСтрока.ЗубВКарте = ?(ЗначениеКопирования = Неопределено, Выборка.ЗубВКарте, Неопределено);
		НоваяСтрока.Изменен = (ЗначениеКопирования = Неопределено);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализацияНового()
	стСвойстваДляЗаполнения = Новый Структура;
	стСвойстваДляЗаполнения.Вставить("TranslateX", 0);
	стСвойстваДляЗаполнения.Вставить("TranslateY", 0);
	стСвойстваДляЗаполнения.Вставить("ScaleX", 1);
	стСвойстваДляЗаполнения.Вставить("ScaleY", 1);
	стСвойстваДляЗаполнения.Вставить("Rotation", 0);
	стСвойстваДляЗаполнения.Вставить("ШиринаКанвы", 800);
	стСвойстваДляЗаполнения.Вставить("ВысотаКанвы", 400);
	
	Для Каждого кзСвойство Из стСвойстваДляЗаполнения Цикл
		Если Объект.Свойство(кзСвойство.Ключ) И Не ЗначениеЗаполнено(Объект[кзСвойство.Ключ]) Тогда
			Объект[кзСвойство.Ключ] = кзСвойство.Значение;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

//Событие, которое никогда не вызовется само, служит для пинка 1Ски из SL
&НаКлиенте
Процедура HTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗагрузитьДанныеПриложения() Экспорт
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	//Если ЗначениеЗаполнено(ВременныйКаталог) Тогда
	//	Каталог = Новый Файл(ВременныйКаталог);
	//	Если Каталог.Существует() Тогда
	//		Попытка
	//			УдалитьФайлы(Каталог.ПолноеИмя);
	//		Исключение
	//			Сообщить(ОписаниеОшибки());
	//		КонецПопытки;
	//	КонецЕсли;
	//КонецЕсли;
КонецПроцедуры

//---------------------ОБРАБОТЧИКИ-СОБЫТИЙ-----------------

&НаКлиенте
Процедура СписокЗубовПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекДанныеЗуб = Элемент.ТекущиеДанные;
	Если ТекДанныеЗуб = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если НоваяСтрока Тогда
		ТекДанныеЗуб.Изменен = Истина;
		ТекДанныеЗуб.ИдентификаторSL = Строка(Новый УникальныйИдентификатор());
		ТекДанныеЗуб.ZIndex = СписокЗубов.Индекс(ТекДанныеЗуб);
	КонецЕсли;
	//запоминается идентификатор зуба на случай изменения
	Если ЗначениеЗаполнено(ТекДанныеЗуб.Зуб) Тогда
		ТекЗубКарты = ТекДанныеЗуб.Зуб.УникальныйИдентификатор();
	Иначе
		ТекЗубКарты = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыЗубаПоУмолчанию(ИдентификаторСтроки)
	ЗаполнитьЗначенияСвойств(СписокЗубов.НайтиПоИдентификатору(ИдентификаторСтроки), 
							 СписокЗубов.НайтиПоИдентификатору(ИдентификаторСтроки).Зуб);
КонецПроцедуры

&НаКлиенте
Процедура СписокЗубовЗубПриИзменении(Элемент)
	
	ТекДанныеЗуб = Элементы.СписокЗубов.ТекущиеДанные;
	Если ТекДанныеЗуб = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПараметрыЗубаПоУмолчанию(Элементы.СписокЗубов.ТекущаяСтрока);
	ТекДанныеЗуб.Изменен = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафическиеПараметрыПриИзменении(Элемент)
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗубовПриАктивизацииСтроки(Элемент)
	
	Если Не КартаИнициализирована Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокЗубовПриИзменении(Элемент)
	
	
	
КонецПроцедуры

//----------ПАРСИНГИ,-ОБМЕН-С-SILVERLIGHT-И-ПР.-----------

&НаКлиенте
Процедура ОбновитьПараметрыПриложения(Параметры) Экспорт
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗубовПередУдалением(Элемент, Отказ)
	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗубовВариантЗубаПоУмолчаниюНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//СтандартнаяОбработка = Ложь;
	ТекСтрока = Элементы.СписокЗубов.ТекущиеДанные;
	Если ТекСтрока = Неопределено Или Не ЗначениеЗаполнено(ТекСтрока.Зуб) Тогда
		Возврат;
	КонецЕсли;
            
    //СписокЭлементов = ПолучитьСписокЭлементов(ТекущийРодитель);
    
    ФормаВыбора = ПолучитьФорму("Справочник.стомВариантыЗубов.Форма.ФормаВыбора",,Элемент);
    
    //ФормаВыбора.Параметры.РежимВыбора = Истина;
    //ФормаВыбора.Открыть();
    ФормаВыбора.Элементы.Список.Отображение = ОтображениеТаблицы.Список;
       
    Отбор = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
    Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии;
    Отбор.ПравоеЗначение = Неопределено;
    Отбор.Использование = Истина;
	//УстановитьОтбор(ПредопределенноеЗначение("Справочник.стомВариантыЗубов.ПустаяСсылка"));
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьОтбор(Значение)
	Форма = Справочники.стомВариантыЗубов.ПолучитьФорму("ФормаВыбора");
	Форма.Список.Отбор.Элементы.Сбросить();
	Отбор = Форма.Список.Отбор.Элементы.Добавить("ВариантЗуба");
	Отбор.Использование = Истина;
	Отбор.Значение = Значение;
	Отбор.ВидСравнения = ВидСравнения.НеРавно;	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Для Каждого СтрокаЗуб Из ТекущийОбъект.СписокЗубов Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаЗуб.ОсновнойВариант) Тогда
			СтрокаЗуб.ОсновнойВариант = СтрокаЗуб.Зуб.ОсновнойВариант;
		КонецЕсли;
		
	КонецЦикла;
	
	//ТекущийОбъект.СтроковоеПредставление = ТекущийОбъект.ПолучитьСтроковоеПредставление(Ложь); 
КонецПроцедуры
	
&НаКлиенте
Процедура ПерерисоватьКарту(ДобавляемыеЗубы = Неопределено, УдаляемыеЗубы = Неопределено)
	
	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтрокуИнициализацииЗубов(ИдентификаторSL = Неопределено)
	
	
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокВариантовИЗубов(ЗначениеКопирования = Неопределено)
	
	СписокЗубов.Очистить();
	ДеревоВариантыКарты = СписокВариантов.ПолучитьЭлементы();
	ДеревоВариантыКарты.Очистить();
	
	Если ЗначениеКопирования = Неопределено Тогда
		ТекОбъект = Объект.Ссылка;
	Иначе
		ТекОбъект = ЗначениеКопирования;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	стомЗубыКарты.Ссылка КАК ЗубВКарте,
	|	стомЗубыКарты.Зуб,
	|	стомЗубыКарты.TranslateX,
	|	стомЗубыКарты.TranslateY,
	|	стомЗубыКарты.Rotation,
	|	стомЗубыКарты.ScaleX,
	|	стомЗубыКарты.ScaleY,
	|	стомЗубыКарты.ZIndex,
	|	стомЗубыКарты.Наименование
	|ПОМЕСТИТЬ ЗубыКарты
	|ИЗ
	|	Справочник.стомЗубыКарты КАК стомЗубыКарты
	|ГДЕ
	|	стомЗубыКарты.Владелец = &ТекОбъект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗубыКарты.ЗубВКарте,
	|	ЗубыКарты.Зуб,
	|	ЗубыКарты.TranslateX,
	|	ЗубыКарты.TranslateY,
	|	ЗубыКарты.Rotation,
	|	ЗубыКарты.ScaleX,
	|	ЗубыКарты.ScaleY,
	|	ЗубыКарты.ZIndex,
	|	ЗубыКарты.Наименование
	|ИЗ
	|	ЗубыКарты КАК ЗубыКарты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	стомВариантыЗубныхКартСписокВариантовЗубов.Ссылка КАК ВариантКарты,
	|	ЗубыКарты.ЗубВКарте,
	|	стомВариантыЗубныхКартСписокВариантовЗубов.ВариантЗуба,
	|	стомВариантыЗубовСписокОбластей.Область
	|ПОМЕСТИТЬ ДеревоВариантов
	|ИЗ
	|	Справочник.стомВариантыЗубныхКарт.СписокВариантовЗубов КАК стомВариантыЗубныхКартСписокВариантовЗубов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.стомВариантыЗубов.СписокОбластей КАК стомВариантыЗубовСписокОбластей
	|		ПО стомВариантыЗубныхКартСписокВариантовЗубов.ВариантЗуба = стомВариантыЗубовСписокОбластей.Ссылка,
	|	ЗубыКарты КАК ЗубыКарты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДеревоВариантов.ВариантКарты КАК ВариантКарты,
	|	ДеревоВариантов.ЗубВКарте КАК ЗубВКарте,
	|	ДеревоВариантов.ВариантЗуба КАК ВариантЗуба,
	|	ДеревоВариантов.Область,
	|	ВЫБОР
	|		КОГДА стомВидыЗубныхКартНастройкаВариантовОбластей.Область ЕСТЬ NULL 
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Установлен
	|ИЗ
	|	ДеревоВариантов КАК ДеревоВариантов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.стомВидыЗубныхКарт.НастройкаВариантовОбластей КАК стомВидыЗубныхКартНастройкаВариантовОбластей
	|		ПО ДеревоВариантов.ВариантКарты = стомВидыЗубныхКартНастройкаВариантовОбластей.ВариантКарты
	|			И ДеревоВариантов.ЗубВКарте = стомВидыЗубныхКартНастройкаВариантовОбластей.ЗубВКарте
	|			И ДеревоВариантов.ВариантЗуба = стомВидыЗубныхКартНастройкаВариантовОбластей.ВариантЗуба
	|			И ДеревоВариантов.Область = стомВидыЗубныхКартНастройкаВариантовОбластей.Область
	|			И (стомВидыЗубныхКартНастройкаВариантовОбластей.Ссылка = &ТекОбъект)
	|ИТОГИ
	|	СУММА(Установлен)
	|ПО
	|	ВариантКарты,
	|	ЗубВКарте,
	|	ВариантЗуба";
	Запрос.УстановитьПараметр("ТекОбъект", ТекОбъект);
	Результат = Запрос.ВыполнитьПакет();
	
	ВыборкаСписокЗубов = Результат[1].Выбрать();
	Пока ВыборкаСписокЗубов.Следующий() Цикл
		
		НоваяСтрока = СписокЗубов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаСписокЗубов);
		НоваяСтрока.ИдентификаторSL = Строка(ВыборкаСписокЗубов.ЗубВКарте.УникальныйИдентификатор());
		НоваяСтрока.ЗубВКарте = ?(ЗначениеКопирования = Неопределено, ВыборкаСписокЗубов.ЗубВКарте, Неопределено);
		НоваяСтрока.Изменен = (ЗначениеКопирования = Неопределено);	
		
	КонецЦикла;
	
	ВыборкаВарианты = Результат[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаВарианты.Следующий() Цикл
		ВыборкаЗубы = ВыборкаВарианты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		ВетвьВариантКарты = ДеревоВариантыКарты.Добавить();
		ВетвьВариантКарты.ВариантОбласть = ВыборкаВарианты.ВариантКарты;
		ВетвьВариантКарты.Установлен = 1;
		ВетвьВариантКарты.УстановленоДетей = ВыборкаВарианты.Установлен;
		ВетвьВариантКарты.Уровень = 0;
		
		ДеревоЗубы = ВетвьВариантКарты.ПолучитьЭлементы();
		Пока ВыборкаЗубы.Следующий() Цикл
			ВыборкаВариантыЗуба = ВыборкаЗубы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			ВетвьЗуб = ДеревоЗубы.Добавить();
			ВетвьЗуб.ВариантОбласть = ВыборкаЗубы.ЗубВКарте;
			ВетвьЗуб.Установлен = 1;
			ВетвьЗуб.УстановленоДетей = ВыборкаЗубы.Установлен;
			ВетвьЗуб.Уровень = 1;
			
			ДеревоВариантыЗуба = ВетвьЗуб.ПолучитьЭлементы();
			Пока ВыборкаВариантыЗуба.Следующий() Цикл
				ВыборкаОбласти = ВыборкаВариантыЗуба.Выбрать();
				
				ВетвьВариантЗуба = ДеревоВариантыЗуба.Добавить();
				ВетвьВариантЗуба.ВариантОбласть = ВыборкаВариантыЗуба.ВариантЗуба;
				Если ВыборкаВариантыЗуба.Установлен = ВыборкаОбласти.Количество() Тогда
					ВетвьВариантЗуба.Установлен = 1;
				ИначеЕсли ВыборкаВариантыЗуба.Установлен = 0 Тогда
					ВетвьВариантЗуба.Установлен = 0;
				Иначе
					ВетвьВариантЗуба.Установлен = 2;
				КонецЕсли;
				ВетвьВариантЗуба.УстановленоДетей = ВыборкаВариантыЗуба.Установлен;
				ВетвьВариантЗуба.Уровень = 2;
				
				ДеревоОбласти = ВетвьВариантЗуба.ПолучитьЭлементы();
				Пока ВыборкаОбласти.Следующий() Цикл
					ВетвьОбласть = ДеревоОбласти.Добавить();
					ВетвьОбласть.ВариантОбласть = ВыборкаОбласти.Область;
					ВетвьОбласть.Установлен = ВыборкаОбласти.Установлен;
					ВетвьОбласть.УстановленоДетей = ВыборкаОбласти.Установлен;
					ВетвьОбласть.Уровень = 3;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;		
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокСегментов(ЗначениеКопирования = Неопределено)
	
	Если ЗначениеКопирования = Неопределено Тогда
		ТекОбъект = Объект.Ссылка;
	Иначе
		ТекОбъект = ЗначениеКопирования;
	КонецЕсли;
	
	СписокСегментов.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	стомСегментыЗубов.Ссылка КАК СегментВЗубе,
	|	стомСегментыЗубов.TranslateX,
	|	стомСегментыЗубов.TranslateY,
	|	стомСегментыЗубов.ScaleX,
	|	стомСегментыЗубов.ScaleY,
	|	стомСегментыЗубов.Rotation,
	|	стомСегментыЗубов.ZIndex КАК ZIndex,
	|	стомСегментыЗубов.Наименование,
	|	стомСегментыЗубов.Сегмент,
	|	стомСегментыЗубов.Сегмент.Область КАК Область
	|ИЗ
	|	Справочник.стомСегментыЗубов КАК стомСегментыЗубов
	|ГДЕ
	|	стомСегментыЗубов.Владелец = &ТекОбъект
	| 	И НЕ стомСегментыЗубов.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ZIndex";
	Запрос.УстановитьПараметр("ТекОбъект", ТекОбъект);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = СписокСегментов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.ИдентификаторSL = Строка(Выборка.СегментВЗубе.УникальныйИдентификатор());
		НоваяСтрока.СегментВЗубе = ?(ЗначениеКопирования = Неопределено, Выборка.СегментВЗубе, Неопределено);
		НоваяСтрока.Изменен = (ЗначениеКопирования = Неопределено);
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВариантовПриАктивизацииСтроки(Элемент)
	ТекДанные = Элемент.ТекущиеДанные; 
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//Если активизировали тот же вариант - перерисовывать зуб не нужно
	Вариант = ОбщегоНазначенияКлиентСерверПереопределяемый.ПолучитьКореньВетвиДерева(ТекДанные);
	Если Вариант = ТекВариантКарты Тогда
		Возврат;
	Иначе
		ТекВариантКарты = Вариант;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	СформироватьЗубыСегментыКарты();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьВариантыКарты()
	
	Объект.НастройкаВариантовОбластей.Очистить();
	ДеревоВариантыКарты = СписокВариантов.ПолучитьЭлементы();
	Для Каждого ВетвьВариантКарты Из ДеревоВариантыКарты Цикл
		ДеревоЗубы = ВетвьВариантКарты.ПолучитьЭлементы();
		Для Каждого ВетвьЗуб Из ДеревоЗубы Цикл
			ДеревоВариантыЗуба = ВетвьЗуб.ПолучитьЭлементы();
			Для Каждого ВетвьВариантЗуба Из ДеревоВариантыЗуба Цикл
				ДеревоОбласти = ВетвьВариантЗуба.ПолучитьЭлементы();
				Для Каждого ВетвьОбласть Из ДеревоОбласти Цикл
					Если ВетвьОбласть.Установлен Тогда
						
						НоваяНастройка = Объект.НастройкаВариантовОбластей.Добавить();
						НоваяНастройка.ВариантКарты = ВетвьВариантКарты.ВариантОбласть;
						НоваяНастройка.ЗубВКарте = ВетвьЗуб.ВариантОбласть;
						НоваяНастройка.ВариантЗуба = ВетвьВариантЗуба.ВариантОбласть;
						НоваяНастройка.Область = ВетвьОбласть.ВариантОбласть;
						
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьЗубыСегментыКарты()
	
	мсЗубыВКарте = Новый Массив;
	
	Для Каждого СтрокаЗуб Из СписокЗубов Цикл
				
		Если ЗначениеЗаполнено(СтрокаЗуб.ЗубВКарте) Тогда //зуб уже существует и заполнен
			Если СтрокаЗуб.Изменен Тогда
				ЗубОбъект = СтрокаЗуб.ЗубВКарте.ПолучитьОбъект();
				ЗаполнитьЗначенияСвойств(ЗубОбъект, СтрокаЗуб);
				ЗубОбъект.Записать();
				ЗубВКарте = ЗубОбъект.Ссылка;
			Иначе
				ЗубВКарте = СтрокаЗуб.ЗубВКарте;
			КонецЕсли;
		Иначе //нужно создать новый
			НовыйЗуб = Справочники.стомЗубыКарты.СоздатьЭлемент();
			ЗаполнитьЗначенияСвойств(НовыйЗуб, СтрокаЗуб);
			НовыйЗуб.Владелец = Объект.Ссылка;	
			НовыйЗуб.Записать();
			ЗубВКарте = НовыйЗуб.Ссылка;
			СтрокаЗуб.ЗубВКарте = ЗубВКарте;
		КонецЕсли;
		СтрокаЗуб.Изменен = Ложь;
		мсЗубыВКарте.Добавить(ЗубВКарте);
		
	КонецЦикла;
	
	мсСегментыВЗубе = Новый Массив;
	
	Для Каждого СтрокаСегмент Из СписокСегментов Цикл
				
		Если ЗначениеЗаполнено(СтрокаСегмент.СегментВЗубе) Тогда //сегмент уже существует и заполнен
			СегментОбъект = СтрокаСегмент.СегментВЗубе.ПолучитьОбъект();
				ЗаполнитьЗначенияСвойств(СегментОбъект, СтрокаСегмент);
				СегментОбъект.Записать();
				СегментВЗубе = СегментОбъект.Ссылка;
		Иначе //нужно создать новый
			НовыйСегмент = Справочники.стомСегментыЗубов.СоздатьЭлемент();
			ЗаполнитьЗначенияСвойств(НовыйСегмент, СтрокаСегмент);
			НовыйСегмент.Владелец = Объект.Ссылка;	
			НовыйСегмент.Записать();
			СегментВЗубе = НовыйСегмент.Ссылка;
			СтрокаСегмент.СегментВЗубе = СегментВЗубе;
		КонецЕсли;
		СтрокаСегмент.Изменен = Ложь;
		мсСегментыВЗубе.Добавить(СегментВЗубе);
	
	КонецЦикла;
	
	СформироватьВариантыКарты();
	
	РеквизитФормыВЗначение("Объект").Записать();
	
	//удаление остальных сегментов
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	стомЗубыКарты.Ссылка
	|ИЗ
	|	Справочник.стомЗубыКарты КАК стомЗубыКарты
	|ГДЕ
	|	стомЗубыКарты.Владелец = &Владелец
	|	И НЕ стомЗубыКарты.Ссылка В (&ЗубыВКарте)";
	Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);
	Запрос.УстановитьПараметр("ЗубыВКарте", мсЗубыВКарте);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ЗубОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ЗубОбъект.Удалить();
		
	КонецЦикла;
	
	//удаление остальных сегментов
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	стомСегментыЗубов.Ссылка
	|ИЗ
	|	Справочник.стомСегментыЗубов КАК стомСегментыЗубов
	|ГДЕ
	|	стомСегментыЗубов.Владелец = &Владелец
	|	И НЕ стомСегментыЗубов.Ссылка В (&СегментыВЗубе)";
	Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);
	Запрос.УстановитьПараметр("СегментыВЗубе", мсСегментыВЗубе);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СегментОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СегментОбъект.Удалить();
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СписокСегментовПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекДанныеСегмент = Элемент.ТекущиеДанные;
	Если ТекДанныеСегмент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НоваяСтрока Тогда
		ТекДанныеСегмент.Изменен = Истина;
		ТекДанныеСегмент.ИдентификаторSL = Строка(Новый УникальныйИдентификатор());
		ТекДанныеСегмент.ZIndex = СписокСегментов.Индекс(ТекДанныеСегмент);		
	КонецЕсли;
	
	//ПерерисоватьЗуб();
	//УстановитьВыделениеЗубов();
	Если ЗначениеЗаполнено(ТекДанныеСегмент.Сегмент) Тогда
		ТекСегментЗуба = ТекДанныеСегмент;		
	Иначе
		ТекСегментЗуба = Неопределено;
	КонецЕсли;
	
КонецПроцедуры
